// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
int n = 6;
int i = 1;
while (i <= n)
{
    Console.WriteLine(i * i * i);
    i++;
}